Revit 2027 API
ParameterTypeId.StairstypeCalculationRules Property
 "Calculation Rules": Calculation Rules
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairstypeCalculationRules { get; }
Public Shared ReadOnly Property StairstypeCalculationRules As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairstypeCalculationRules {
	ForgeTypeId^ get ();
}
static member StairstypeCalculationRules : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace